In [4]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [5]:
df = pd.DataFrame(data={'col1':[0,np.nan,2,3,4,np.nan,np.nan],'col2':[100,500,200,300,400,600,800]})

In [5]:
df

   col1  col2
0   0.0   100
1   NaN   500
2   2.0   200
3   3.0   300
4   4.0   400
5   NaN   600
6   NaN   800

In [4]:
df.isnull().sum()

col1    3
col2    0
dtype: int64

In [5]:
df.ffill() ##fill fowarded values  in the place of null

   col1  col2
0   0.0   100
1   0.0   500
2   2.0   200
3   3.0   300
4   4.0   400
5   4.0   600
6   4.0   800

In [6]:
df.bfill() # fill backwarded values in the place of null

   col1  col2
0   0.0   100
1   2.0   500
2   2.0   200
3   3.0   300
4   4.0   400
5   NaN   600
6   NaN   800

In [7]:
df.dropna(axis=0)

   col1  col2
0   0.0   100
2   2.0   200
3   3.0   300
4   4.0   400

In [8]:
df.dropna(axis=1)

   col2
0   100
1   500
2   200
3   300
4   400
5   600
6   800

In [9]:
df.dropna(thresh=int(df.shape[0]*.9),axis=1)  ## df.shape[0] = total row values 7*0.9=> 6.3 => thresh = 6 ,meaning the column 
at least have 6 non-missing values

   col2
0   100
1   500
2   200
3   300
4   400
5   600
6   800

In [3]:
## fill mean value in the place of null
df['col1'].fillna(df['col1'].mean())

0    0.00
1    2.25
2    2.00
3    3.00
4    4.00
5    2.25
6    2.25
Name: col1, dtype: float64

In [4]:
# 1+2-0/2-0 = 1
df['col1'].interpolate()

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    4.0
6    4.0
Name: col1, dtype: float64

In [7]:
df.replace(np.nan,0)

   col1  col2
0   0.0   100
1   0.0   500
2   2.0   200
3   3.0   300
4   4.0   400
5   0.0   600
6   0.0   800

In [8]:
df = pd.DataFrame(data={'col1':[np.nan,-np.inf,2,3,4,np.inf,np.nan],'col2':[1,-np.inf,2,3,4,6,8]})

In [9]:
df

   col1  col2
0   NaN   1.0
1  -inf  -inf
2   2.0   2.0
3   3.0   3.0
4   4.0   4.0
5   inf   6.0
6   NaN   8.0

In [10]:
df.isnull().sum()

col1    2
col2    0
dtype: int64

In [11]:
df.sum()

/home/codespace/.local/lib/python3.10/site-packages/numpy/_core/_methods.py:52: RuntimeWarning: invalid value encountered in reduce
  return umr_sum(a, axis, dtype, out, keepdims, initial, where)

col1    NaN
col2   -inf
dtype: float64

In [13]:
df.replace([np.inf,-np.inf],np.nan,inplace=True)

In [17]:
df.isnull().sum()

col1    4
col2    1
dtype: int64